// Задача 1 - Задайте двумерный массив. Напишите программу, которая упорядочит по убыванию элементы каждой строки двумерного массива.




// Задача 2 - Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.






// Задача 3 - Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.





// Задача 4 - Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.






// Задача 5 - Напишите программу, которая заполнит спирально массив 4 на 4.


